foamCases/newMesh0/teste2/system/probesTimeFlow10
probesTimeFlow10
{
        // Where to load it from
        libs ( "libsampling.so" );
        type            probes;
        // Name of the directory for probe data
        name            probesTimeFlow10;
        // Write at same frequency as fields
        writeControl   timeStep;
        writeInterval  1;
        // Fields to be probed
        fields
        (
            p
        );

        probeLocations
		(
			(-100.0 0 0)
			(-99.98 0 0)
			(-99.96 0 0)
			(-99.94 0 0)
			(-99.92 0 0)
			(-99.9 0 0)
			(-99.88 0 0)
			(-99.86 0 0)
			(-99.84 0 0)
			(-99.82 0 0)
			(-99.8 0 0)
			(-99.78 0 0)
			(-99.76 0 0)
			(-99.74 0 0)
			(-99.72 0 0)
			(-99.7 0 0)
			(-99.68 0 0)
			(-99.66 0 0)
			(-99.64 0 0)
			(-99.62 0 0)
			(-99.6 0 0)
			(-99.58 0 0)
			(-99.56 0 0)
			(-99.54 0 0)
			(-99.52 0 0)
			(-99.5 0 0)
			(-99.48 0 0)
			(-99.46 0 0)
			(-99.44 0 0)
			(-99.42 0 0)
			(-99.4 0 0)
			(-99.38 0 0)
			(-99.36 0 0)
			(-99.34 0 0)
			(-99.32 0 0)
			(-99.3 0 0)
			(-99.28 0 0)
			(-99.26 0 0)
			(-99.24 0 0)
			(-99.22 0 0)
			(-99.2 0 0)
			(-99.18 0 0)
			(-99.16 0 0)
			(-99.14 0 0)
			(-99.12 0 0)
			(-99.1 0 0)
			(-99.08 0 0)
			(-99.06 0 0)
			(-99.04 0 0)
			(-99.02 0 0)
			(-99.0 0 0)
			(-98.98 0 0)
			(-98.96 0 0)
			(-98.94 0 0)
			(-98.92 0 0)
			(-98.9 0 0)
			(-98.88 0 0)
			(-98.86 0 0)
			(-98.84 0 0)
			(-98.82 0 0)
			(-98.8 0 0)
			(-98.78 0 0)
			(-98.76 0 0)
			(-98.74 0 0)
			(-98.72 0 0)
			(-98.7 0 0)
			(-98.68 0 0)
			(-98.66 0 0)
			(-98.64 0 0)
			(-98.62 0 0)
			(-98.6 0 0)
			(-98.58 0 0)
			(-98.56 0 0)
			(-98.54 0 0)
			(-98.52 0 0)
			(-98.5 0 0)
			(-98.48 0 0)
			(-98.46 0 0)
			(-98.44 0 0)
			(-98.42 0 0)
			(-98.4 0 0)
			(-98.38 0 0)
			(-98.36 0 0)
			(-98.34 0 0)
			(-98.32 0 0)
			(-98.3 0 0)
			(-98.28 0 0)
			(-98.26 0 0)
			(-98.24 0 0)
			(-98.22 0 0)
			(-98.2 0 0)
			(-98.18 0 0)
			(-98.16 0 0)
			(-98.14 0 0)
			(-98.12 0 0)
			(-98.1 0 0)
			(-98.08 0 0)
			(-98.06 0 0)
			(-98.04 0 0)
...
		);
        
}